In [1]:
!pip install sqlalchemy==1.3.9
# %config SqlMagic.style = 'COMPACT'
!pip install ibm_db_sa
!pip install ipython-sql==0.4.1
# !pip install prettytable==2.0.0

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: sqlalchemy==1.3.9 in c:\users\adama\appdata\roaming\python\python312\site-packages (1.3.9)

WARNING: Ignoring invalid distribution ~qlalchemy (C:\Users\adama\AppData\Roaming\Python\Python312\site-packages)
WARNING: Ignoring invalid distribution ~qlalchemy (C:\Users\adama\AppData\Roaming\Python\Python312\site-packages)
WARNING: Ignoring invalid distribution ~qlalchemy (C:\Users\adama\AppData\Roaming\Python\Python312\site-packages)
WARNING: Ignoring invalid distribution ~qlalchemy (C:\Users\adama\AppData\Roaming\Python\Python312\site-packages)
WARNING: Ignoring invalid distribution ~qlalchemy (C:\Users\adama\AppData\Roaming\Python\Python312\site-packages)

[notice] A new release of pip is available: 24.2 -> 24.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: ibm_db_sa in c:\users\adama\appdata\roaming\python\python312\site-packages (0.4.1)
Requirement already satisfied: sqlalchemy>=0.7.3 in c:\users\adama\appdata\roaming\python\python312\site-packages (from ibm_db_sa) (1.3.9)
Requirement already satisfied: ibm-db>=2.0.0 in c:\users\adama\appdata\roaming\python\python312\site-packages (from ibm_db_sa) (3.2.3)

WARNING: Ignoring invalid distribution ~qlalchemy (C:\Users\adama\AppData\Roaming\Python\Python312\site-packages)
WARNING: Ignoring invalid distribution ~qlalchemy (C:\Users\adama\AppData\Roaming\Python\Python312\site-packages)
WARNING: Ignoring invalid distribution ~qlalchemy (C:\Users\adama\AppData\Roaming\Python\Python312\site-packages)
WARNING: Ignoring invalid distribution ~qlalchemy (C:\Users\adama\AppData\Roaming\Python\Python312\site-packages)
WARNING: Ignoring invalid distribution ~qlalchemy (C:\Users\adama\AppData\Roaming\Python\Python312\site-packages)

[notice] A new release of pip is available: 24.2 -> 24.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip
WARNING: Ignoring invalid distribution ~qlalchemy (C:\Users\adama\AppData\Roaming\Python\Python312\site-packages)
WARNING: Ignoring invalid distribution ~qlalchemy (C:\Users\adama\AppData\Roaming\Python\Python312\site-packages)
WARNING: Ignoring invalid distribution ~qlalchemy (C:\Users\adama\AppData\Roaming\Python\Python312\site-packages)
WARNING: Ignoring invalid distribution ~qlalchemy (C:\Users\adama\AppData\Roaming\Python\Python312\site-packages)
WARNING: Ignoring invalid distribution ~qlalchemy (C:\Users\adama\AppData\Roaming\Python\Python312\site-packages)

[notice] A new release of pip is available: 24.2 -> 24.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: ipython-sql==0.4.1 in c:\users\adama\appdata\roaming\python\python312\site-packages (0.4.1)
Requirement already satisfied: prettytable<1 in c:\users\adama\appdata\roaming\python\python312\site-packages (from ipython-sql==0.4.1) (0.7.2)
Requirement already satisfied: ipython>=1.0 in c:\users\adama\appdata\roaming\python\python312\site-packages (from ipython-sql==0.4.1) (8.29.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in c:\users\adama\appdata\roaming\python\python312\site-packages (from ipython-sql==0.4.1) (1.3.9)
Requirement already satisfied: sqlparse in c:\users\adama\appdata\roaming\python\python312\site-packages (from ipython-sql==0.4.1) (0.5.1)
Requirement already satisfied: six in c:\users\adama\appdata\roaming\python\python312\site-packages (from ipython-sql==0.4.1) (1.16.0)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\users\adama\appdata\roaming\python\python312\site-packages (from ipython-sql==0.4.1) (0.2.0)
Requirement already satisfied: decorator in c:\users\adama\appdata\roaming\python\python312\site-packages (from ipython>=1.0->ipython-sql==0.4.1) (5.1.1)
Requirement already satisfied: jedi>=0.16 in c:\users\adama\appdata\roaming\python\python312\site-packages (from ipython>=1.0->ipython-sql==0.4.1) (0.19.1)
Requirement already satisfied: matplotlib-inline in c:\users\adama\appdata\roaming\python\python312\site-packages (from ipython>=1.0->ipython-sql==0.4.1) (0.1.7)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.41 in c:\users\adama\appdata\roaming\python\python312\site-packages (from ipython>=1.0->ipython-sql==0.4.1) (3.0.48)
Requirement already satisfied: pygments>=2.4.0 in c:\users\adama\appdata\roaming\python\python312\site-packages (from ipython>=1.0->ipython-sql==0.4.1) (2.18.0)
Requirement already satisfied: stack-data in c:\users\adama\appdata\roaming\python\python312\site-packages (from ipython>=1.0->ipython-sql==0.4.1) (0.6.3)
Requirement already satisfied: traitlets>=5.13.0 in c:\users\adama\appdata\roaming\python\python312\site-packages (from ipython>=1.0->ipython-sql==0.4.1) (5.14.3)
Requirement already satisfied: colorama in c:\users\adama\appdata\roaming\python\python312\site-packages (from ipython>=1.0->ipython-sql==0.4.1) (0.4.6)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in c:\users\adama\appdata\roaming\python\python312\site-packages (from jedi>=0.16->ipython>=1.0->ipython-sql==0.4.1) (0.8.4)
Requirement already satisfied: wcwidth in c:\users\adama\appdata\roaming\python\python312\site-packages (from prompt-toolkit<3.1.0,>=3.0.41->ipython>=1.0->ipython-sql==0.4.1) (0.2.13)
Requirement already satisfied: executing>=1.2.0 in c:\users\adama\appdata\roaming\python\python312\site-packages (from stack-data->ipython>=1.0->ipython-sql==0.4.1) (2.1.0)
Requirement already satisfied: asttokens>=2.1.0 in c:\users\adama\appdata\roaming\python\python312\site-packages (from stack-data->ipython>=1.0->ipython-sql==0.4.1) (2.4.1)
Requirement already satisfied: pure-eval in c:\users\adama\appdata\roaming\python\python312\site-packages (from stack-data->ipython>=1.0->ipython-sql==0.4.1) (0.2.3)

In [2]:
!pip install wheel
!pip install pymysql

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: wheel in c:\users\adama\appdata\roaming\python\python312\site-packages (0.44.0)

WARNING: Ignoring invalid distribution ~qlalchemy (C:\Users\adama\AppData\Roaming\Python\Python312\site-packages)
WARNING: Ignoring invalid distribution ~qlalchemy (C:\Users\adama\AppData\Roaming\Python\Python312\site-packages)
WARNING: Ignoring invalid distribution ~qlalchemy (C:\Users\adama\AppData\Roaming\Python\Python312\site-packages)
WARNING: Ignoring invalid distribution ~qlalchemy (C:\Users\adama\AppData\Roaming\Python\Python312\site-packages)
WARNING: Ignoring invalid distribution ~qlalchemy (C:\Users\adama\AppData\Roaming\Python\Python312\site-packages)

[notice] A new release of pip is available: 24.2 -> 24.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pymysql in c:\users\adama\appdata\roaming\python\python312\site-packages (1.1.1)

WARNING: Ignoring invalid distribution ~qlalchemy (C:\Users\adama\AppData\Roaming\Python\Python312\site-packages)
WARNING: Ignoring invalid distribution ~qlalchemy (C:\Users\adama\AppData\Roaming\Python\Python312\site-packages)
WARNING: Ignoring invalid distribution ~qlalchemy (C:\Users\adama\AppData\Roaming\Python\Python312\site-packages)
WARNING: Ignoring invalid distribution ~qlalchemy (C:\Users\adama\AppData\Roaming\Python\Python312\site-packages)
WARNING: Ignoring invalid distribution ~qlalchemy (C:\Users\adama\AppData\Roaming\Python\Python312\site-packages)

[notice] A new release of pip is available: 24.2 -> 24.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [3]:
import pymysql
pymysql.install_as_MySQLdb()

In [4]:
%load_ext sql

In [5]:
%sql mysql://k610User:k610Password@localhost:3306/k610Transactions

In [6]:
%%sql
# Table Name: STUDENTS (0%)
CREATE TABLE IF NOT EXISTS STUDENTS ( 
Student_ID			INT NOT NULL PRIMARY KEY,
Student_Birthdate	DATETIME,
Student_First_Name	VARCHAR(32),
Student_Last_Name	VARCHAR(32),
Student_email		VARCHAR(32),
Student_Gender		VARCHAR(6),
Student_Citizenship	VARCHAR(16)
);


# Table Name: INSTRUCTORS (0%)
CREATE TABLE IF NOT EXISTS INSTRUCTORS ( 
Instructor_code			INT NOT NULL PRIMARY KEY,
Instructor_First_Name	VARCHAR(32),
Instructor_Last_Name	VARCHAR(32),
Instructor_Area			VARCHAR(32),
Instructor_School		VARCHAR(32),
Student_email			VARCHAR(32)

);

# Table Name: COURSES (2.5%)
CREATE TABLE IF NOT EXISTS COURSES ( 
    Course_Code INT NOT NULL PRIMARY KEY,
    Course_Name VARCHAR(64) NOT NULL,
    Course_Offering VARCHAR(16) NOT NULL,
    Instructor_Code INT NOT NULL

);

#Table Name: GRADES (5%)
CREATE TABLE IF NOT EXISTS GRADES ( 
    Student_ID INT NOT NULL,
    Course_Code INT NOT NULL,
    Course_Grade FLOAT NOT NULL,
    PRIMARY KEY (Student_ID, Course_Code)
);

 * mysql://k610User:***@localhost:3306/k610Transactions
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [15]:
%%sql
ALTER TABLE `INSTRUCTORS` 
CHANGE COLUMN `INSTRUCTORS`.`Student_email` `INSTRUCTORS`.`Instructor_email` VARCHAR(32)

 * mysql://k610User:***@localhost:3306/k610Transactions
0 rows affected.

[]

In [18]:
%%sql

INSERT INTO STUDENTS(Student_ID, Student_Birthdate, Student_First_Name, Student_Last_Name,
Student_email, Student_Gender, Student_Citizenship) VALUES
(2673, '2004-08-19', 'Chris', 'Adams', 'adamsc.mcmaster.ca', 'Male', 'Canada'),
(2889, '2003-12-24', 'Muhammad', 'Bakar', 'bakarm@mcmaster.ca', 'Male', 'Egypt'),
(3108, '2002-02-09', 'Yuki', 'Nakamura', 'nakamuray@mcmaster.ca', 'Female', 'Japan'),
(3330, '2001-06-02', 'Carlos', 'Mendoza', 'mendozac@mcmaster.ca', 'Male', 'Spain'),
(3555, '2000-05-06', 'Luca', 'Rossini', 'rossinil@mcmaster.ca', 'Male', 'Canada'),
(3783, '2002-07-01', 'Fatima', 'Khan', 'khanfa@mcmaster.ca', 'Female', 'Pakistan'),
(4014, '2001-09-02', 'Ayna', 'Ivanova', 'ivanovaa@mcmaster.ca', 'Female', 'Russia'),
(4248, '2002-05-17', 'Raj', 'Patel', 'patelra@mcmaster.ca', 'Male', 'India'),
(4485, '2001-03-08', 'Sofia', 'Garcia', 'garcias@mcmaster.ca', 'Female', 'Spain'),
(4725, '2001-02-03', 'Mei Ling', 'Zhang', 'zhangml@mcmaster.ca', 'Female', 'China'),
(5648, '2000-08-29', 'Andrew', 'Penn', 'Penna@mcmaster.ca', 'Male', 'Canada')

 * mysql://k610User:***@localhost:3306/k610Transactions
11 rows affected.

[]

In [19]:
%%sql

INSERT INTO INSTRUCTORS(Instructor_code, Instructor_First_Name, Instructor_Last_Name,
Instructor_Area, Instructor_School, Instructor_email) VALUES
(303, 'Aisha', 'Ahmed', 'Marketing', 'Business', 'ahmeda@mcmaster.ca'),
(306, 'Johan', 'Verneulen', 'Information systems', 'Business',
'vermeulenj@mcmaster.ca'),
(309, 'Emma', 'Li', 'Finance', 'Economy', 'Liem34@mcmaster.ca'),
(312, 'Elena', 'Silva', 'Strategic Management', 'Business', 'silvae@mcmaster.ca')

 * mysql://k610User:***@localhost:3306/k610Transactions
4 rows affected.

[]

In [20]:
%%sql

INSERT INTO COURSES(Course_Code, Course_Name, Course_Offering) VALUES
(1, 'Human Resource Management', 'First Semester'),
(2, 'Operational Management', 'First Semester'),
(3, 'Business Analytics', 'First Semester'),
(4, 'Accounting', 'First Semester'),
(5, 'Financial Management', 'Second Semester'),
(6, 'Strategic Management', 'Second Semester'),
(7, 'Digital Transformation', 'Second Semester'),
(8, 'Data mining', 'Second Semester'),
(9, 'Business Consulting', 'Third Semester'),
(10, 'Negotiation', 'Third Semester'),
(11, 'Marketing Management', 'Third Semester'),
(12, 'Project Management', 'Third Semester'),
(13, 'Health Management', 'Fourth Semester'),
(14, 'Economics', 'Fourth Semester'),
(15, 'AI in Business', 'Fourth Semester')

 * mysql://k610User:***@localhost:3306/k610Transactions
15 rows affected.

[]

In [21]:
%%sql

INSERT INTO GRADES(Student_ID, Course_Code, Course_Grade) VALUES
(5648, 10002, 90.1),
(3783, 10004, 63.5),
(4248, 10003, 74.6),
(4014, 10008, 75.8),
(3330, 10013, 75.9),
(3555, 10010, 80.6),
(4014, 10011, 60.5),
(3783, 10015, 94.3),
(3783, 10008, 67.8),
(4725, 10004, 89.1),
(4725, 10009, 85.6),
(3783, 10014, 67.8),
(2889, 10003, 65.9),
(4485, 10007, 79.2),
(4248, 10010, 92.3),
(4725, 10013, 63.1),
(2673, 10012, 89.6),
(3783, 10009, 81.7),
(4725, 10010, 64.4),
(2889, 10002, 83.3),
(3330, 10014, 84.1),
(3330, 10002, 61.3),
(4014, 10012, 78.6),
(3555, 10009, 65.9),
(3108, 10004, 82),
(4248, 10005, 85.4),
(2889, 10013, 58.1),
(3555, 10015, 67.3),
(4014, 10009, 72.5),
(4725, 10014, 71.4),
(3108, 10002, 77.4),
(4014, 10001, 66.9),
(4485, 10010, 67.2),
(2673, 10014, 76.9),
(5648, 10012, 83.4),
(4248, 10002, 58.6),
(3783, 10010, 77.3),
(3108, 10012, 57.2),
(5648, 10013, 63.1),
(2673, 10011, 85.8),
(5648, 10006, 88.8),
(3108, 10008, 75.1),
(5648, 10007, 85),
(4725, 10001, 60.8),
(2673, 10002, 88.4),
(4248, 10001, 72.2),
(4248, 10014, 86.4),
(3330, 10009, 85.1),
(3108, 10007, 88),
(4485, 10005, 85.8),
(4485, 10012, 94.1),
(3330, 10006, 76.4),
(3108, 10014, 90.3),
(2673, 10013, 93.3),
(5648, 10004, 82.4),
(4014, 10006, 66.2),
(5648, 10014, 71.4),
(4485, 10011, 77.6),
(2889, 10011, 78.2),
(4725, 10015, 62.1),
(2889, 10007, 88.8),
(2673, 10008, 89),
(3555, 10011, 59.2),
(3555, 10013, 87.6)

 * mysql://k610User:***@localhost:3306/k610Transactions
64 rows affected.

[]

<h2>Task 6.1</h2>

In [7]:
%%sql

SELECT Student_First_Name, 
    Student_Last_Name,
    Student_Birthdate,
    Student_email,
    Student_Gender
    FROM STUDENTS
    WHERE Student_Citizenship = 'Canada';

 * mysql://k610User:***@localhost:3306/k610Transactions
3 rows affected.

[('Chris', 'Adams', datetime.datetime(2004, 8, 19, 0, 0), 'adamsc.mcmaster.ca', 'Male'),
 ('Luca', 'Rossini', datetime.datetime(2000, 5, 6, 0, 0), 'rossinil@mcmaster.ca', 'Male'),
 ('Andrew', 'Penn', datetime.datetime(2000, 8, 29, 0, 0), 'Penna@mcmaster.ca', 'Male')]

*Ran in SQL Query tab in PHP MyAdmin:*

Student_First_Name	Student_Last_Name	Student_Birthdate	Student_email	Student_Gender	
Chris	Adams	2004-08-19 00:00:00	adamsc.mcmaster.ca	Male	
Luca	Rossini	2000-05-06 00:00:00	rossinil@mcmaster.ca	Male	
Andrew	Penn	2000-08-29 00:00:00	Penna@mcmaster.ca	Male

<h2>Task 6.2 </h2>

In [8]:
%%sql
SELECT DISTINCT `Student_Citizenship` FROM STUDENTS

 * mysql://k610User:***@localhost:3306/k610Transactions
8 rows affected.

[('Canada',),
 ('Egypt',),
 ('Japan',),
 ('Spain',),
 ('Pakistan',),
 ('Russia',),
 ('India',),
 ('China',)]

<h2>Task 6.3 </h2>

In [9]:
%%sql
SELECT `Course_Code`, `Course_Name`
FROM COURSES
WHERE `Course_Offering` = 'Second Semester'

 * mysql://k610User:***@localhost:3306/k610Transactions
4 rows affected.

[(10005, 'Financial Management'),
 (10006, 'Strategic Management'),
 (10007, 'Digital Transformation'),
 (10008, 'Data mining')]

<h2>Task 6.4</h2>

In [10]:
%%sql

SELECT `Instructor_First_Name`, `Instructor_Last_Name`, `Instructor_email`
FROM INSTRUCTORS I1
WHERE I1.`Instructor_code` IN (SELECT C1.`Instructor_Code`
FROM COURSES C1
WHERE C1.`Course_Offering` = 'Third Semester')

 * mysql://k610User:***@localhost:3306/k610Transactions
2 rows affected.

[('Aisha', 'Ahmed', 'ahmeda@mcmaster.ca'),
 ('Elena', 'Silva', 'silvae@mcmaster.ca')]

<h2>Task 6.5</h2>

In [11]:
%%sql

SELECT `Student_First_Name`, `Student_Last_Name`, `Student_email` FROM STUDENTS S1
WHERE S1.`Student_ID` IN (
SELECT G1.`Student_ID` FROM GRADES G1
WHERE G1.`Course_Code` IN (
SELECT C1.`Course_Code` FROM COURSES C1
WHERE C1.`Instructor_Code` IN (
SELECT I1.`Instructor_code` FROM INSTRUCTORS I1
WHERE I1.`Instructor_School` = "Economy"
)
)
)

 * mysql://k610User:***@localhost:3306/k610Transactions
8 rows affected.

[('Chris', 'Adams', 'adamsc.mcmaster.ca'),
 ('Yuki', 'Nakamura', 'nakamuray@mcmaster.ca'),
 ('Carlos', 'Mendoza', 'mendozac@mcmaster.ca'),
 ('Fatima', 'Khan', 'khanfa@mcmaster.ca'),
 ('Raj', 'Patel', 'patelra@mcmaster.ca'),
 ('Sofia', 'Garcia', 'garcias@mcmaster.ca'),
 ('Mei Ling', 'Zhang', 'zhangml@mcmaster.ca'),
 ('Andrew', 'Penn', 'Penna@mcmaster.ca')]

<h2>Task 6.6</h2>

In [17]:
%%sql

SELECT  
    (SELECT Student_First_Name FROM STUDENTS S1 WHERE S1.STUDENT_ID = G1.STUDENT_ID) Student_First_Name,
    (SELECT Student_Last_Name FROM STUDENTS S1 WHERE S1.STUDENT_ID = G1.STUDENT_ID) Student_Last_Name,
    (SELECT Student_email FROM STUDENTS S1 WHERE S1.STUDENT_ID = G1.STUDENT_ID) Student_email,
    Course_Grade
FROM GRADES G1
WHERE G1.Course_Grade > 90.0

 * mysql://k610User:***@localhost:3306/k610Transactions
6 rows affected.

[('Chris', 'Adams', 'adamsc.mcmaster.ca', 93.3),
 ('Yuki', 'Nakamura', 'nakamuray@mcmaster.ca', 90.3),
 ('Fatima', 'Khan', 'khanfa@mcmaster.ca', 94.3),
 ('Raj', 'Patel', 'patelra@mcmaster.ca', 92.3),
 ('Sofia', 'Garcia', 'garcias@mcmaster.ca', 94.1),
 ('Andrew', 'Penn', 'Penna@mcmaster.ca', 90.1)]

<h2>Task 6.7</h2>

In [18]:
%%sql
SELECT  
    (SELECT Student_First_Name FROM STUDENTS S1 WHERE S1.STUDENT_ID = G1.STUDENT_ID) Student_First_Name,
    (SELECT Student_Last_Name FROM STUDENTS S1 WHERE S1.STUDENT_ID = G1.STUDENT_ID) Student_Last_Name,
    (SELECT Student_email FROM STUDENTS S1 WHERE S1.STUDENT_ID = G1.STUDENT_ID) Student_email,
    Course_Grade
FROM GRADES G1
WHERE G1.Course_Grade BETWEEN 75 AND 85 AND G1.Course_Code IN (SELECT C1.Course_Code FROM courses C1 WHERE C1.Course_Name = 'Project Management')

 * mysql://k610User:***@localhost:3306/k610Transactions
2 rows affected.

[('Ayna', 'Ivanova', 'ivanovaa@mcmaster.ca', 78.6),
 ('Andrew', 'Penn', 'Penna@mcmaster.ca', 83.4)]

<h2>Task 6.8</h2>

In [19]:
%%sql

SELECT  
     (SELECT Student_Gender FROM STUDENTS S1 WHERE S1.Student_ID = G1.Student_ID) AS Student_Gender,
     AVG(G1.Course_Grade) AS Average_Grade
FROM GRADES G1
GROUP BY Student_Gender;

 * mysql://k610User:***@localhost:3306/k610Transactions
2 rows affected.

[('Female', 74.77666676839193), ('Male', 78.65882402307847)]

<h2>Task 6.9</h2>

In [21]:
%%sql

SELECT
    (SELECT Student_Gender FROM STUDENTS S1 WHERE S1.Student_ID = G1.Student_ID) AS Student_Gender,
    AVG(G1.Course_Grade) AS Average_Grade
FROM GRADES G1
GROUP BY Student_Gender;

 * mysql://k610User:***@localhost:3306/k610Transactions
2 rows affected.

[('Female', 74.77666676839193), ('Male', 78.65882402307847)]

<h2>Task 6.10</h2>

In [22]:
%%sql

SELECT  
    (SELECT Instructor_First_Name FROM INSTRUCTORS I1 WHERE I1.Instructor_Code = C1.Instructor_Code) AS Instructor_First_Name,
    (SELECT Instructor_Last_Name FROM INSTRUCTORS I1 WHERE I1.Instructor_Code = C1.Instructor_Code) AS Instructor_Last_Name,
    AVG(G1.Course_Grade) AS Average_Grade
FROM GRADES G1
JOIN COURSES C1 ON G1.Course_Code = C1.Course_Code
GROUP BY C1.Instructor_Code;

 * mysql://k610User:***@localhost:3306/k610Transactions
4 rows affected.

[('Aisha', 'Ahmed', 73.06999988555908),
 ('Johan', 'Verneulen', 77.91538531963641),
 ('Emma', 'Li', 79.73077040452223),
 ('Elena', 'Silva', 78.16111098395453)]